Tekla Open API Reference for Tekla Structures 2025
AutoDirectionTypeAttribute Constructor (Int32)
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AutoDirectionTypeAttribute(
	int Type
)
Public Sub New (
	Type As Integer
)
Parameters
Type
Type: System.Int32
The auto direction type.
See Also
Reference
AutoDirectionTypeAttribute Class
AutoDirectionTypeAttribute Overload
Tekla.Structures.Plugins Namespace